app/controllers/posts_controller.rb

def index
   @posts = Post.all end
---
SELECT "posts".* FROM "posts"